{
  "backend/main.mo": "Main actor defining data types (Task, ChecklistItem, Goal, PerformanceRating, Reflection) and CRUD operations for tasks, dailies, goals, performance ratings, and reflections with Map-based storage and migration support.",
  "backend/migration.mo": "Migration module that adds a reflections Map to existing actor state, initializing it as empty for users upgrading from the old schema.",
  "feature_evidence.json": "Feature evidence report documenting three completed features: DailyReflection component creation, React Query hooks for reflection operations, and integration into DateDetailsPanel.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing component responsibilities, styling approach, and mobile-responsive design patterns.",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH color system variables for light and dark modes with warm earth tones (terracotta, sage, cream).",
  "frontend/index.html": "HTML entry point with viewport meta tag and root div for React mounting.",
  "frontend/src/App.tsx": "Root application component with ThemeProvider, responsive grid layout organizing Calendar, DailyChecklist, FutureGoals, and TaskList components with Header, Footer, and Toaster.",
  "frontend/src/components/Calendar.tsx": "Interactive calendar component with month navigation, task indicators, performance rating indicators, touch-friendly date selection (44px targets), and DateDetailsPanel integration for selected dates.",
  "frontend/src/components/ChecklistItem.tsx": "Individual checklist item with touch-friendly checkbox (44px minimum), toggle functionality via useToggleDaily hook, and responsive text wrapping with strikethrough for completed items.",
  "frontend/src/components/DailyChecklist.tsx": "Displays a daily checklist card with progress tracking, allowing users to add, view, and manage checklist items with completion status.",
  "frontend/src/components/DailyReflection.tsx": "Provides a textarea for daily reflection notes with auto-save functionality (1 second debounce) and displays Sanskrit text \"एकत्रा\" and \"वीर भोग्या वसुंधरा\".",
  "frontend/src/components/DateDetailsPanel.tsx": "Shows a detailed panel for a selected date including performance rating, daily reflection, and task list with completed/incomplete counts.",
  "frontend/src/components/Footer.tsx": "Renders a footer with attribution to caffeine.ai and copyright information.",
  "frontend/src/components/FutureGoals.tsx": "Displays a card for managing future goals with target dates, allowing users to add new goals and view existing ones.",
  "frontend/src/components/GoalItem.tsx": "Renders an individual goal item with checkbox, text, target date, and overdue indicator.",
  "frontend/src/components/Header.tsx": "Application header with branding, Internet Identity login/logout functionality, and truncated principal display.",
  "frontend/src/components/PerformanceRating.tsx": "Provides a 1-10 rating interface for daily performance tracking with button grid layout.",
  "frontend/src/components/TaskForm.tsx": "Form component for creating new tasks with title, description, and due date fields, converting dates to nanoseconds for Internet Computer.",
  "frontend/src/components/TaskItem.tsx": "Displays an individual task with toggle completion status, due date, overdue indicator, and optional compact mode.",
  "frontend/src/components/TaskList.tsx": "React component that displays tasks in two sections (active and completed), with a form to add new tasks, loading skeletons, and responsive mobile-first design using shadcn/ui components.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance based on Internet Identity authentication state, automatically recreating the actor and invalidating queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flow, identity persistence, and authentication status with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for managing tasks, daily checklist items, goals, performance ratings, and reflections with CRUD operations, toast notifications, and automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm earth-tone color palette (terracotta, sage green, cream) for both light and dark modes using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom colors using OKLCH values, typography, container queries, animations, and responsive breakpoints for the productivity application design system.",
  "project_state.json": "Project metadata tracking implemented features including calendar view, task management, daily checklist, authentication, and responsive design for a desktop-focused progress tracking application."
}